<?php
    $a = 5;
    $b = '05';
    var_dump($a == $b);         
/* Почему true? 
Ответ: переменная a равна переменной b, тк происходит сравнение с привидением типов
*/
    var_dump((int)'012345');     /* Почему 12345?
Ответ: 12345 ,тк привидение к целому типу int
    */
    var_dump((float)123.0 === (int)123.0); /* Почему false?
Ответ: false, тк выполняем сравнение без привидения типов, в первом случае вещественный тип, во втором целый тип int
*/
    var_dump((int)0 === (int)'hello, world'); /* Почему true?
Ответ: true, тк выполняем сравнение без привидения типов
*/
?>

<br>

<?php
$a = 1;
$b = 2;
/* чтоб переменная a старла равна 2
*/
$a=$b++;
echo $a;
/* чтоб переменная b старла равна 1
*/
$b=++$а;
echo $b;
?>
